tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "sst/tap"
# Collection of portable C++ source libraries
brew "boost"
# Object-file caching compiler wrapper
brew "ccache"
# GitHub command-line tool
brew "gh"
# Git-compatible distributed version control system
brew "jj"
# Handy way to save and run project-specific commands
brew "just"
# LLVM's OpenMP runtime library
brew "libomp"
# Apple Silicon Monitor Top written in Golang
brew "mactop"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Command-line interface for SQLite
brew "sqlite"
# Platform built on V8 to build network applications
brew "node"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit", link: false
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# UNIX shell (command interpreter)
brew "zsh"
# The AI coding agent built for the terminal.
brew "sst/tap/opencode"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Anthropic's official Claude AI desktop app
cask "claude"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# ZSA keyboard firmware flasher
cask "keymapp"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Discover, download, and run local LLMs
cask "lm-studio"
# VPN client
cask "mullvad-vpn"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
# Control your tools with a few keystrokes
cask "raycast"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
vscode "esbenp.prettier-vscode"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "skellock.just"
vscode "tamasfe.even-better-toml"
vscode "vscodevim.vim"
